espressif/esp-idf/components/soc/esp32h4/register/soc/i2s_reg.h
/** I2S_STATE_REG register
 *  I2S TX status register
 */
#define I2S_STATE_REG(i) (REG_I2S_BASE(i) + 0x6c)
/** I2S_TX_IDLE : RO; bitpos: [0]; default: 1;
 *  1: i2s_tx is idle state. 0: i2s_tx is working.
 */
#define I2S_TX_IDLE    (BIT(0))
#define I2S_TX_IDLE_M  (I2S_TX_IDLE_V << I2S_TX_IDLE_S)
#define I2S_TX_IDLE_V  0x00000001U
#define I2S_TX_IDLE_S  0

/** I2S_ETM_CONF_REG register
 *  I2S ETM configure register
 */
#define I2S_ETM_CONF_REG(i) (REG_I2S_BASE(i) + 0x70)
/** I2S_ETM_TX_SEND_WORD_NUM : R/W; bitpos: [13:0]; default: 64;
 *  I2S ETM send x words event. When sending word number of
 *  reg_etm_tx_send_word_num[13:0], i2s will trigger an etm event.
 */
#define I2S_ETM_TX_SEND_WORD_NUM    0x00003FFFU
#define I2S_ETM_TX_SEND_WORD_NUM_M  (I2S_ETM_TX_SEND_WORD_NUM_V << I2S_ETM_TX_SEND_WORD_NUM_S)
#define I2S_ETM_TX_SEND_WORD_NUM_V  0x00003FFFU
#define I2S_ETM_TX_SEND_WORD_NUM_S  0
/** I2S_ETM_RX_RECEIVE_WORD_NUM : R/W; bitpos: [27:14]; default: 64;
 *  I2S ETM receive x words event. When receiving word number of
 *  reg_etm_rx_receive_word_num[13:0], i2s will trigger an etm event.
 */
#define I2S_ETM_RX_RECEIVE_WORD_NUM    0x00003FFFU
#define I2S_ETM_RX_RECEIVE_WORD_NUM_M  (I2S_ETM_RX_RECEIVE_WORD_NUM_V << I2S_ETM_RX_RECEIVE_WORD_NUM_S)
#define I2S_ETM_RX_RECEIVE_WORD_NUM_V  0x00003FFFU
#define I2S_ETM_RX_RECEIVE_WORD_NUM_S  14

/** I2S_IDEAL_CNT_REG register
 *  I2S sync counter register
 */
#define I2S_IDEAL_CNT_REG(i) (REG_I2S_BASE(i) + 0x74)
/** I2S_TX_IDEAL_CNT : R/W; bitpos: [30:0]; default: 0;
 *  tx fifo counter ideal value.
 */
#define I2S_TX_IDEAL_CNT    0x7FFFFFFFU
#define I2S_TX_IDEAL_CNT_M  (I2S_TX_IDEAL_CNT_V << I2S_TX_IDEAL_CNT_S)
#define I2S_TX_IDEAL_CNT_V  0x7FFFFFFFU
#define I2S_TX_IDEAL_CNT_S  0

/** I2S_FIFO_CNT_REG register
 *  I2S sync counter register
 */
#define I2S_FIFO_CNT_REG(i) (REG_I2S_BASE(i) + 0x78)
/** I2S_TX_FIFO_CNT : RO; bitpos: [30:0]; default: 0;
 *  tx fifo counter value.
 */
#define I2S_TX_FIFO_CNT    0x7FFFFFFFU
#define I2S_TX_FIFO_CNT_M  (I2S_TX_FIFO_CNT_V << I2S_TX_FIFO_CNT_S)
#define I2S_TX_FIFO_CNT_V  0x7FFFFFFFU
#define I2S_TX_FIFO_CNT_S  0
/** I2S_TX_FIFO_CNT_RST : WT; bitpos: [31]; default: 0;
 *  Set this bit to reset tx fifo counter.
 */
#define I2S_TX_FIFO_CNT_RST    (BIT(31))
#define I2S_TX_FIFO_CNT_RST_M  (I2S_TX_FIFO_CNT_RST_V << I2S_TX_FIFO_CNT_RST_S)
#define I2S_TX_FIFO_CNT_RST_V  0x00000001U
#define I2S_TX_FIFO_CNT_RST_S  31

/** I2S_BCK_CNT_REG register
 *  I2S sync counter register
 */
#define I2S_BCK_CNT_REG(i) (REG_I2S_BASE(i) + 0x7c)
/** I2S_TX_BCK_CNT : RO; bitpos: [30:0]; default: 0;
 *  tx bck counter value.
 */
#define I2S_TX_BCK_CNT    0x7FFFFFFFU
#define I2S_TX_BCK_CNT_M  (I2S_TX_BCK_CNT_V << I2S_TX_BCK_CNT_S)
#define I2S_TX_BCK_CNT_V  0x7FFFFFFFU
#define I2S_TX_BCK_CNT_S  0
/** I2S_TX_BCK_CNT_RST : WT; bitpos: [31]; default: 0;
 *  Set this bit to reset tx bck counter.
 */
#define I2S_TX_BCK_CNT_RST    (BIT(31))
#define I2S_TX_BCK_CNT_RST_M  (I2S_TX_BCK_CNT_RST_V << I2S_TX_BCK_CNT_RST_S)
#define I2S_TX_BCK_CNT_RST_V  0x00000001U
#define I2S_TX_BCK_CNT_RST_S  31

/** I2S_CNT_DIFF_REG register
 *  I2S sync counter register
 */
#define I2S_CNT_DIFF_REG(i) (REG_I2S_BASE(i) + 0x80)
/** I2S_TX_CNT_DIFF : RO; bitpos: [30:0]; default: 0;
 *  tx bck counter value.
 */
#define I2S_TX_CNT_DIFF    0x7FFFFFFFU
#define I2S_TX_CNT_DIFF_M  (I2S_TX_CNT_DIFF_V << I2S_TX_CNT_DIFF_S)
#define I2S_TX_CNT_DIFF_V  0x7FFFFFFFU
#define I2S_TX_CNT_DIFF_S  0
/** I2S_TX_CNT_DIFF_RST : WT; bitpos: [31]; default: 0;
 *  Set this bit to reset fifo counter difference.
 */
#define I2S_TX_CNT_DIFF_RST    (BIT(31))
#define I2S_TX_CNT_DIFF_RST_M  (I2S_TX_CNT_DIFF_RST_V << I2S_TX_CNT_DIFF_RST_S)
#define I2S_TX_CNT_DIFF_RST_V  0x00000001U
#define I2S_TX_CNT_DIFF_RST_S  31

/** I2S_SYNC_SW_THRES_REG register
 *  I2S sync counter register
 */
#define I2S_SYNC_SW_THRES_REG(i) (REG_I2S_BASE(i) + 0x84)
/** I2S_TX_CNT_DIFF_SW_THRES : R/W; bitpos: [30:0]; default: 0;
 *  tx fifo counter difference software threshold value, when difference larger than
 *  this threshold, interrupt will occur and hardware sync will not be executed.
 */
#define I2S_TX_CNT_DIFF_SW_THRES    0x7FFFFFFFU
#define I2S_TX_CNT_DIFF_SW_THRES_M  (I2S_TX_CNT_DIFF_SW_THRES_V << I2S_TX_CNT_DIFF_SW_THRES_S)
#define I2S_TX_CNT_DIFF_SW_THRES_V  0x7FFFFFFFU
#define I2S_TX_CNT_DIFF_SW_THRES_S  0

/** I2S_SYNC_HW_THRES_REG register
 *  I2S sync counter register
 */
#define I2S_SYNC_HW_THRES_REG(i) (REG_I2S_BASE(i) + 0x88)
/** I2S_TX_CNT_DIFF_HW_THRES : R/W; bitpos: [30:0]; default: 0;
 *  tx fifo counter difference hardware threshold value, which means that only when
 *  difference larger than this threshold will hardware start hardware sync.
 */
#define I2S_TX_CNT_DIFF_HW_THRES    0x7FFFFFFFU
#define I2S_TX_CNT_DIFF_HW_THRES_M  (I2S_TX_CNT_DIFF_HW_THRES_V << I2S_TX_CNT_DIFF_HW_THRES_S)
#define I2S_TX_CNT_DIFF_HW_THRES_V  0x7FFFFFFFU
#define I2S_TX_CNT_DIFF_HW_THRES_S  0

/** I2S_HW_SYNC_CONF_REG register
 *  I2S TX hardware sync function configuration register
 */
#define I2S_HW_SYNC_CONF_REG(i) (REG_I2S_BASE(i) + 0x8c)
/** I2S_TX_HW_SYNC_EN : R/W; bitpos: [0]; default: 0;
 *  Configure whether enable i2s tx hardware sync function. 1: Enable. 0: Disable
 */
#define I2S_TX_HW_SYNC_EN    (BIT(0))
#define I2S_TX_HW_SYNC_EN_M  (I2S_TX_HW_SYNC_EN_V << I2S_TX_HW_SYNC_EN_S)
#define I2S_TX_HW_SYNC_EN_V  0x00000001U
#define I2S_TX_HW_SYNC_EN_S  0
/** I2S_TX_HW_SYNC_SUPPL_MODE : R/W; bitpos: [1]; default: 0;
 *  Configure the i2s tx hardware sync supplementation mode. 1: Supplement the data
 *  configured in I2S_TX_HW_SYNC_SUPPL_DATA[31:0]. 0: Supplement the last data.
 */
#define I2S_TX_HW_SYNC_SUPPL_MODE    (BIT(1))
#define I2S_TX_HW_SYNC_SUPPL_MODE_M  (I2S_TX_HW_SYNC_SUPPL_MODE_V << I2S_TX_HW_SYNC_SUPPL_MODE_S)
#define I2S_TX_HW_SYNC_SUPPL_MODE_V  0x00000001U
#define I2S_TX_HW_SYNC_SUPPL_MODE_S  1

/** I2S_HW_SYNC_DATA_REG register
 *  I2S TX hardware sync function configuration register
 */
#define I2S_HW_SYNC_DATA_REG(i) (REG_I2S_BASE(i) + 0x90)
/** I2S_TX_HW_SYNC_SUPPL_DATA : R/W; bitpos: [31:0]; default: 0;
 *  Configure the i2s tx hardware sync supplementation data when
 *  I2S_TX_HW_SYNC_SUPPL_MODE is 1.
 */
#define I2S_TX_HW_SYNC_SUPPL_DATA    0xFFFFFFFFU
#define I2S_TX_HW_SYNC_SUPPL_DATA_M  (I2S_TX_HW_SYNC_SUPPL_DATA_V << I2S_TX_HW_SYNC_SUPPL_DATA_S)
#define I2S_TX_HW_SYNC_SUPPL_DATA_V  0xFFFFFFFFU
#define I2S_TX_HW_SYNC_SUPPL_DATA_S  0

/** I2S_CLK_GATE_REG register
 *  Clock gate register
 */
#define I2S_CLK_GATE_REG(i) (REG_I2S_BASE(i) + 0xf8)
/** I2S_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  set this bit to enable clock gate
 */
#define I2S_CLK_EN    (BIT(0))
#define I2S_CLK_EN_M  (I2S_CLK_EN_V << I2S_CLK_EN_S)
#define I2S_CLK_EN_V  0x00000001U
#define I2S_CLK_EN_S  0

/** I2S_DATE_REG register
 *  Version control register
 */
#define I2S_DATE_REG(i) (REG_I2S_BASE(i) + 0xfc)
/** I2S_DATE : R/W; bitpos: [27:0]; default: 37818432;
 *  I2S version control register
 */
#define I2S_DATE    0x0FFFFFFFU
#define I2S_DATE_M  (I2S_DATE_V << I2S_DATE_S)
#define I2S_DATE_V  0x0FFFFFFFU
#define I2S_DATE_S  0

#ifdef __cplusplus
}
#endif
